"""
4.  Представлен список чисел. Определить элементы списка, не имеющие повторений.
    Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке
    их следования в исходном списке. Для выполнения задания обязательно использовать генератор.

    Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
    Результат: [23, 1, 3, 10, 4, 11]
"""
from random import randint

a = -10
b = 10
base_list = [randint(a, b) for i in range(1, 21)]
print(f'Исходный список: {base_list}')
print(f'Элементы списка, не имеющие повторений: {[el for el in base_list if base_list.count(el) == 1]}')